{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "output_dim": 20, "batch_input_shape": [null, 20]}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 30, "b_regularizer": null, "W_regularizer": null, "output_dim": 30, "batch_input_shape": [null, 30]}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 30, "b_regularizer": null, "W_regularizer": null, "output_dim": 30, "batch_input_shape": [null, 30]}}]}], "name": "merge_1", "concat_axis": -1, "arguments": {}, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "mode": "concat"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 80, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 20}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 10}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}}]}